{
    "title": "Software Development Agreement",
    "metadata": {
      "contract_type": "development",
      "effective_date": "2023-04-01T00:00:00Z",
      "expiration_date": "2024-04-01T00:00:00Z",
      "parties": [
        {"name": "TechCorp Inc.", "id": "party-001"},
        {"name": "DevConsulting LLC", "id": "party-002"}
      ],
      "status": "active",
      "tags": ["software", "development", "consulting"]
    },
    "clauses": [
      {
        "id": "clause-001",
        "title": "Scope of Work",
        "type": "scope",
        "text": "Developer shall develop custom software according to the specifications outlined in Exhibit A. The software shall include user management, reporting, and data visualization components.",
        "position": 1,
        "metadata": {
          "importance": "high",
          "negotiated": true
        }
      },
      {
        "id": "clause-002",
        "title": "Payment Terms",
        "type": "payment",
        "text": "Client shall pay Developer a total fee of $150,000 USD for the services. Payment shall be made in three installments: 30% upon contract signing, 40% upon completion of milestone 1, and 30% upon final delivery.",
        "position": 2,
        "metadata": {
          "importance": "high",
          "negotiated": true
        }
      },
      {
        "id": "clause-003",
        "title": "Intellectual Property Rights",
        "type": "ip",
        "text": "Upon full payment, Client shall own all rights, title, and interest in the developed software. Developer retains rights to general programming techniques and libraries used in development that were not created specifically for Client.",
        "position": 3,
        "metadata": {
          "importance": "high",
          "negotiated": true
        }
      },
      {
        "id": "clause-004",
        "title": "Confidentiality",
        "type": "confidentiality",
        "text": "Both parties agree to maintain the confidentiality of any proprietary information shared during the course of this agreement. Confidential information includes but is not limited to source code, business plans, customer data, and financial information.",
        "position": 4,
        "metadata": {
          "importance": "medium",
          "negotiated": false
        }
      },
      {
        "id": "clause-005",
        "title": "Term and Termination",
        "type": "term",
        "text": "This Agreement shall commence on the Effective Date and continue until all services have been performed, but no later than the Expiration Date. Either party may terminate this Agreement with 30 days written notice if the other party materially breaches this Agreement and fails to cure such breach within the notice period.",
        "position": 5,
        "metadata": {
          "importance": "medium",
          "negotiated": true
        }
      },
      {
        "id": "clause-006",
        "title": "Warranty",
        "type": "warranty",
        "text": "Developer warrants that the software will substantially conform to the specifications for a period of 90 days after final delivery. This warranty does not apply to issues arising from Client's modifications or incorrect use of the software.",
        "position": 6,
        "metadata": {
          "importance": "medium",
          "negotiated": false
        }
      },
      {
        "id": "clause-007",
        "title": "Limitation of Liability",
        "type": "liability",
        "text": "Neither party shall be liable for any indirect, incidental, special, consequential, or punitive damages. Developer's total liability under this Agreement shall not exceed the total fees paid by Client.",
        "position": 7,
        "metadata": {
          "importance": "medium",
          "negotiated": true
        }
      },
      {
        "id": "clause-008",
        "title": "Dispute Resolution",
        "type": "disputes",
        "text": "Any disputes arising under this Agreement shall first be attempted to be resolved through good faith negotiation. If negotiation fails, disputes shall be resolved through binding arbitration in accordance with the rules of the American Arbitration Association.",
        "position": 8,
        "metadata": {
          "importance": "low",
          "negotiated": false
        }
      }
    ]
  }